gsap.registerPlugin(MorphSVGPlugin);

const tl = gsap.timeline({
  repeat: -1, // 無限ループ
  yoyo: true, // モーフィングが終了したら元の形状に戻る
  ease: "rotaional"
});


tl.to("#morph-path", {
  duration: 10,
  origin: "50% 50%",
  morphSVG: {
    shape: "M62.24,102.28c-12.2-.27-28.33-2.77-41.08-9.06C7.81,86.63-1.83,75.88.64,59.18c2.05-13.88,8.85-29.72,15.36-42.07C23.13,3.56,33.88-2.05,49.08,1.11c14.74,3.07,30.76,10.76,43.13,21.77,9.37,8.33,16.65,18.57,19.73,30.15,8.33,31.41-21.84,49.83-49.69,49.26Z",
    map: "size",
    precision: 5
  },
  immediateRender: false // アニメーションが次に進む時に停止しない
});


tl.to("#morph-path", {
  duration: 10,
  origin: "50% 50%",
  morphSVG: {
    shape: "M18.14,102.2c-33.17,1.78-12.85-20.18,2.22-29.1,19.53-11.57,41.23-19.95,62.14-28.65,20.78-8.65,41.55-17.35,62.48-25.64C161.63,12.21,184.66-.56,202.76.29c23.52,1.1,12.71,15.39-4.34,29.46-14.74,12.15-34.14,24.14-40.07,27.29-41.05,21.83-92.99,45.16-140.2,45.16h0Z",
    map: "size",
    precision: 5
  },
  immediateRender: false // アニメーションが次に進む時に停止しない
});
